#=======================================================================#
# Chapter 8：マルコフ連鎖モンテカルロ(MCMC)法とベイズ統計モデル
#=======================================================================#
old.op <- options(max.print=999999)

#====================================================================#
# 8.1 例題：種子の生存確率（個体差なし）
#====================================================================#

#データ作成(20個の各植物個体の生存種子数)
y <- c(4,3,4,5,5,2,3,1,4,0,1,5,5,6,5,4,4,5,3,4)

#================================================================#
#図8.1(B)を描画
#データのヒストグラムとq=0.45の二項分布の確率質量関数を重ねて描く
#================================================================#
hist(y, breaks=seq(-0.5, 9.5, 1), xlab="生存種子数 y", ylab="Frequency")
x <- 0:8
binomial <- dbinom(x, 8, 0.45)
lines(x, 20*binomial, type="b", lty=2)

#================================================================#
#図8.2を描画
#対数尤度関数を描く
#================================================================#
logL <- function(q){
  sum(dbinom(y, 8, q, log=TRUE))
}
q <- seq(0.2, 0.7, 0.01)
LogLikelihood <- sapply(q, logL)
plot(q, LogLikelihood, type="l", xlab="生存確率 q", ylab="対数尤度")

#==============================================#
#【+α】optimize関数を使った対数尤度関数の最大化
#==============================================#
# optimize関数：1変数の最適化(最小化)を行なう関数

LogLikelihood1 <- function(q){
  -sum(dbinom(y, 8, q, log=TRUE))
}
optimize(LogLikelihood1, c(0.2, 0.7))

#====================================================================#
# 8.2 ふらふら試行錯誤による最尤推定
#====================================================================#

#================================================================#
#図8.3を描画
#qを離散化したときの対数尤度関数を描く
#================================================================#
#plot(q, LogLikelihood, xlim=c(0.2, 0.7))

#================================================================#
#図8.4を描画
#図8.3のq=0.30附近を拡大した図を描く
#================================================================#
#plot(q, LogLikelihood, xlim=c(0.28, 0.32), ylim=c(-49, -44))

#================================================================#
#図8.5を描くための計算
#================================================================#

#qを0.01～0.99まで0.01きざみで離散化
q2 <- seq(0.01, 0.99, 0.01)

#各qに対して対数尤度を計算
LogLikelihood2 <- sapply(q2, logL)

#ステップ数の設定
maxstep = 99

#配列を作成
random = numeric(maxstep+1)
q3 <- array(0,dim=c(maxstep+1,7))

#qの初期値
#0.30, 0.35, 0.40, 0.45, 0.50, 0.55, 0.60の7通りやってみる
q3[1,1] <- q2[30]
q3[1,2] <- q2[35]
q3[1,3] <- q2[40]
q3[1,4] <- q2[45]
q3[1,5] <- q2[50]
q3[1,6] <- q2[55]
q3[1,7] <- q2[60]

for(i in 1:7){
  for(step in 1:maxstep){
    
    #確率0.5で左隣を，確率0.5で右隣を選ぶ(一様乱数を生成)
    temp <- runif(1, 1, 3)
    random[step] <- floor(temp)
    
    #左に移動する場合
    if(random[step] == 1){
      
      #隣の対数尤度の方が大きければ移動，小さければ移動しない
      if(LogLikelihood2[(q3[step, i]*100)] < LogLikelihood2[(q3[step,i]*100)-1]){
        q3[step+1,i] <- q2[(q3[step,i]*100)-1]
      }
      else{
        q3[step+1,i] <- q2[(q3[step,i]*100)]
      }
    }
    
    #右に移動する場合
    if(random[step] == 2){
      
      #隣の対数尤度の方が大きければ移動，小さければ移動しない
      if(LogLikelihood2[(q3[step, i]*100)] < LogLikelihood2[(q3[step,i]*100)+1]){
        q3[step+1,i] <- q2[(q3[step,i]*100)+1]
      }
      else{
        q3[step+1,i] <- q2[(q3[step,i]*100)]
      }
    }
  }
}

#================================================================#
#図8.5を描画
#================================================================#
step <- seq(1, maxstep+1, 1)
plot(step, q3[,1], type="l", ylim=c(0.3,0.6), xlab="ステップ数", ylab="生存確率 q")
lines(step, q3[,2], lty=2)
lines(step, q3[,3], lty=3)
lines(step, q3[,4], lty=4)
lines(step, q3[,5], lty=5)
lines(step, q3[,6], lty=6)
lines(step, q3[,7], lty=7)

#====================================================================#
# 8.3 MCMCアルゴリズムのひとつ
#====================================================================#

#================================================================#
#図8.8をを描くための計算
#【注意】図8.5を描くときに使用したLogLikelihood2を使用
#================================================================#

#ステップ数の設定
#【注意】
#ステップ数=100にするなら「maxstep = 99」にする
#ステップ数=1000にするなら「maxstep = 999」にする
maxstep = 99999

#配列を作成
random = numeric(maxstep+1)
q4 =numeric(maxstep+1)

#qの初期値(0.3とする)
q4[1] <- q2[30]

for(step in 1:maxstep){
  
  #確率0.5で左隣を，確率0.5で右隣を選ぶ(一様乱数を生成)
  if(q4[step] == 0.01){
    random[step] = 2
  }
  if(q4[step] == 0.99){
    random[step] = 1
  }
  if(!(q4[step] == 0.01) && !(q4[step] == 0.99)){
    temp <- runif(1, 1, 3)
    random[step] <- floor(temp)
  }
    
  #左に移動する場合
  if(random[step] == 1){
    
    #尤度比rを計算
    r <- exp(LogLikelihood2[(q4[step]*100)-1] - LogLikelihood2[(q4[step]*100)])
    temp2 <- runif(1, 0, 1)
    
    #隣の対数尤度の方が大きければ移動，小さくても確率rで移動
    if(LogLikelihood2[(q4[step]*100)] < LogLikelihood2[(q4[step]*100)-1]){
      q4[step+1] <- q2[(q4[step]*100)-1]
    }
    else{
      
      if(temp2 < r){
        q4[step+1] <- q2[(q4[step]*100)-1]
      }
      
      else q4[step+1] <- q2[q4[step]*100] 
    }
  }
  
  #右に移動する場合
  if(random[step] == 2){
    
    #尤度比rを計算
    r <- exp(LogLikelihood2[(q4[step]*100)+1] - LogLikelihood2[(q4[step]*100)])
    temp2 <- runif(1, 0, 1)
    
    #隣の対数尤度の方が大きければ移動，小さくても確率rで移動
    if(LogLikelihood2[(q4[step]*100)] < LogLikelihood2[(q4[step]*100)+1]){
      q4[step+1] <- q2[(q4[step]*100)+1]
    }
    else{
      
      if(temp2 < r){
        q4[step+1] <- q2[(q4[step]*100)+1]
      }
      
      else q4[step+1] <- q2[q4[step]*100]
    }
  }
}

#================================================================#
#図8.8を描画
#================================================================#
step <- seq(1, maxstep+1, 1)
plot(step, q4, type="l", ylim=c(0.0,1.0), xlab="ステップ数", ylab="生存確率 q", main="(A)100 MCMC stepまで")
hist(q4, breaks=100, xlab="生存確率 q", ylab="Frequency", xlim=c(0.0, 1.0), main="(A)100 MCMC stepまで")

#================================================================#
#図8.9を描くための計算
#================================================================#

#ステップ数の設定
maxstep = 499

#配列を作成
random = numeric(maxstep+1)
q5 <- array(0,dim=c(maxstep+1,7))

#qの初期を設定値(7通りやってみる)
q5[1,1] <- q2[20]
q5[1,2] <- q2[30]
q5[1,3] <- q2[40]
q5[1,4] <- q2[50]
q5[1,5] <- q2[60]
q5[1,6] <- q2[70]
q5[1,7] <- q2[80]

for(i in 1:7){
  for(step in 1:maxstep){
    
    #確率0.5で左隣を，確率0.5で右隣を選ぶ(一様乱数を生成)
    if(q5[step,i] == 0.01){
      random[step] = 2
    }
    if(q5[step,i] == 0.99){
      random[step] = 1
    }
    if(!(q5[step,i] == 0.01) && !(q5[step,i] == 0.99)){
      temp <- runif(1, 1, 3)
      random[step] <- floor(temp)
    }
    
    #左に移動する場合
    if(random[step] == 1){
      
      #尤度比rを計算
      r <- exp(LogLikelihood2[(q5[step,i]*100)-1] - LogLikelihood2[(q5[step,i]*100)])
      temp2 <- runif(1, 0, 1)
      
      #隣の対数尤度の方が大きければ移動，小さくても確率rで移動
      if(LogLikelihood2[(q5[step, i]*100)] < LogLikelihood2[(q5[step,i]*100)-1]){
        q5[step+1,i] <- q2[(q5[step,i]*100)-1]
      }
      else{
        
        if(temp2 < r){
          q5[step+1,i] <- q2[(q5[step,i]*100)-1]
        }
        
        else q5[step+1,i] <- q2[q5[step,i]*100]
      }
    }
    
    #右に移動する場合
    if(random[step] == 2){
      
      #尤度比rを計算
      r <- exp(LogLikelihood2[(q5[step,i]*100)+1] - LogLikelihood2[(q5[step,i]*100)])
      temp2 <- runif(1, 0, 1)
      
      #隣の対数尤度の方が大きければ移動，小さくても確率rで移動
      if(LogLikelihood2[(q5[step, i]*100)] < LogLikelihood2[(q5[step,i]*100)+1]){
        q5[step+1,i] <- q2[(q5[step,i]*100)+1]
      }
      else{
        
        if(temp2 < r){
          q5[step+1,i] <- q2[(q5[step,i]*100)+1]
        }
        
        else q5[step+1,i] <- q2[q5[step,i]*100]
      }
    }
  }
}

#==================================#
#図8.9を描画
#==================================#
step <- seq(1, maxstep+1, 1)
plot(step, q5[,1], type="l", ylim=c(0.0,1.0), xlab="ステップ数", ylab="生存確率q")
lines(step, q5[,2], lty=1)
lines(step, q5[,3], lty=1)
lines(step, q5[,4], lty=1)
lines(step, q5[,5], lty=1)
lines(step, q5[,6], lty=1)
lines(step, q5[,7], lty=1)

#================================================================#
#図8.10を描画
#================================================================#
#図8.10(A)
Likelihood = exp(LogLikelihood2)
plot(q2, Likelihood, type="b", xlim=c(0.2, 0.7), xlab="生存確率 q", main="尤度関数 L(q)")

#図8.10(B)
hist(q4, freq=FALSE, breaks=100, xlab="生存確率 q", xlim=c(0.2, 0.7), main="定常分布 p(q|Y)")
